RT-Thread/rt-thread/bsp/stm32/stm32h747-st-discovery/board/CubeMX_Config/MDK-ARM/startup_stm32h747xx_CM4.s
; Reset handler
Reset_Handler    PROC
                 EXPORT  Reset_Handler                    [WEAK]
        IMPORT  SystemInit
        IMPORT  __main

                 LDR     R0, =SystemInit
                 BLX     R0
                 LDR     R0, =__main
                 BX      R0
                 ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler                      [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler                [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler                [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler                 [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler               [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler                      [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler                  [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler                    [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler                   [WEAK]
                B       .
                ENDP                                     
                                                          
Default_Handler PROC                                      

                EXPORT  WWDG_IRQHandler                   [WEAK]                                       
                EXPORT  PVD_AVD_IRQHandler                [WEAK]                         
                EXPORT  TAMP_STAMP_IRQHandler             [WEAK]   
                EXPORT  RTC_WKUP_IRQHandler               [WEAK]             
                EXPORT  FLASH_IRQHandler                  [WEAK]                                        
                EXPORT  RCC_IRQHandler                    [WEAK]                                          
                EXPORT  EXTI0_IRQHandler                  [WEAK]                                            
                EXPORT  EXTI1_IRQHandler                  [WEAK]                                           
                EXPORT  EXTI2_IRQHandler                  [WEAK]                                            
                EXPORT  EXTI3_IRQHandler                  [WEAK]                                            
                EXPORT  EXTI4_IRQHandler                  [WEAK]
                EXPORT  DMA1_Stream0_IRQHandler           [WEAK] 
                EXPORT  DMA1_Stream1_IRQHandler           [WEAK]                        
                EXPORT  DMA1_Stream2_IRQHandler           [WEAK]                     
                EXPORT  DMA1_Stream3_IRQHandler           [WEAK]                    
                EXPORT  DMA1_Stream4_IRQHandler           [WEAK]                        
                EXPORT  DMA1_Stream5_IRQHandler           [WEAK]                          
                EXPORT  DMA1_Stream6_IRQHandler           [WEAK]
                EXPORT  DMA1_Stream7_IRQHandler           [WEAK]
                EXPORT  ADC_IRQHandler                    [WEAK]                          
                EXPORT  FDCAN1_IT0_IRQHandler             [WEAK]                                            
                EXPORT  FDCAN2_IT0_IRQHandler             [WEAK] 
                EXPORT  FDCAN1_IT1_IRQHandler             [WEAK]                                            
                EXPORT  FDCAN2_IT1_IRQHandler             [WEAK]   
                EXPORT  EXTI9_5_IRQHandler                [WEAK]                                    
                EXPORT  TIM1_BRK_IRQHandler               [WEAK]                  
                EXPORT  TIM1_UP_IRQHandler                [WEAK]                
                EXPORT  TIM1_TRG_COM_IRQHandler           [WEAK] 
                EXPORT  TIM1_CC_IRQHandler                [WEAK]                                   
                EXPORT  TIM2_IRQHandler                   [WEAK]                                            
                EXPORT  TIM3_IRQHandler                   [WEAK]                                            
                EXPORT  TIM4_IRQHandler                   [WEAK]                                            
                EXPORT  I2C1_EV_IRQHandler                [WEAK]                                             
                EXPORT  I2C1_ER_IRQHandler                [WEAK]                                             
                EXPORT  I2C2_EV_IRQHandler                [WEAK]                                            
                EXPORT  I2C2_ER_IRQHandler                [WEAK]                                               
                EXPORT  SPI1_IRQHandler                   [WEAK]                                           
                EXPORT  SPI2_IRQHandler                   [WEAK]                                            
                EXPORT  USART1_IRQHandler                 [WEAK]                                          
                EXPORT  USART2_IRQHandler                 [WEAK]                                          
                EXPORT  USART3_IRQHandler                 [WEAK]                                         
                EXPORT  EXTI15_10_IRQHandler              [WEAK]                                  
                EXPORT  RTC_Alarm_IRQHandler              [WEAK]                                       
                EXPORT  TIM8_BRK_TIM12_IRQHandler         [WEAK]                 
                EXPORT  TIM8_UP_TIM13_IRQHandler          [WEAK]                 
                EXPORT  TIM8_TRG_COM_TIM14_IRQHandler     [WEAK] 
                EXPORT  TIM8_CC_IRQHandler                [WEAK]                                   
                EXPORT  DMA1_Stream7_IRQHandler           [WEAK]                                          
                EXPORT  FMC_IRQHandler                    [WEAK]                                             
                EXPORT  SDMMC1_IRQHandler                 [WEAK]                                             
                EXPORT  TIM5_IRQHandler                   [WEAK]                                             
                EXPORT  SPI3_IRQHandler                   [WEAK]                                             
                EXPORT  UART4_IRQHandler                  [WEAK]                                            
                EXPORT  UART5_IRQHandler                  [WEAK]                                            
                EXPORT  TIM6_DAC_IRQHandler               [WEAK]                   
                EXPORT  TIM7_IRQHandler                   [WEAK]                    
                EXPORT  DMA2_Stream0_IRQHandler           [WEAK]                                  
                EXPORT  DMA2_Stream1_IRQHandler           [WEAK]                                   
                EXPORT  DMA2_Stream2_IRQHandler           [WEAK]                                    
                EXPORT  DMA2_Stream3_IRQHandler           [WEAK]                                    
                EXPORT  DMA2_Stream4_IRQHandler           [WEAK]                                 
                EXPORT  ETH_IRQHandler                    [WEAK]                                         
                EXPORT  ETH_WKUP_IRQHandler               [WEAK]                     
                EXPORT  FDCAN_CAL_IRQHandler              [WEAK]                                                                                                                                                                              
                EXPORT  CM7_SEV_IRQHandler                [WEAK]                                                                                                                                                                              
                EXPORT  CM4_SEV_IRQHandler                [WEAK]                                                                                                                                                                              
                EXPORT  DMA2_Stream5_IRQHandler           [WEAK]                                   
                EXPORT  DMA2_Stream6_IRQHandler           [WEAK]                                   
                EXPORT  DMA2_Stream7_IRQHandler           [WEAK]                                   
                EXPORT  USART6_IRQHandler                 [WEAK]                                           
                EXPORT  I2C3_EV_IRQHandler                [WEAK]                                              
                EXPORT  I2C3_ER_IRQHandler                [WEAK]                                              
                EXPORT  OTG_HS_EP1_OUT_IRQHandler         [WEAK]                      
                EXPORT  OTG_HS_EP1_IN_IRQHandler          [WEAK]                      
                EXPORT  OTG_HS_WKUP_IRQHandler            [WEAK]                        
                EXPORT  OTG_HS_IRQHandler                 [WEAK]                                      
                EXPORT  DCMI_IRQHandler                   [WEAK]                                             
                EXPORT  RNG_IRQHandler                    [WEAK]
                EXPORT  FPU_IRQHandler                    [WEAK]
                EXPORT  UART7_IRQHandler                  [WEAK]
                EXPORT  UART8_IRQHandler                  [WEAK]
                EXPORT  SPI4_IRQHandler                   [WEAK]
                EXPORT  SPI5_IRQHandler                   [WEAK]
                EXPORT  SPI6_IRQHandler                   [WEAK]
                EXPORT  SAI1_IRQHandler                   [WEAK]
                EXPORT  LTDC_IRQHandler                   [WEAK]
                EXPORT  LTDC_ER_IRQHandler                [WEAK]
                EXPORT  DMA2D_IRQHandler                  [WEAK]
                EXPORT  SAI2_IRQHandler                   [WEAK]   
                EXPORT  QUADSPI_IRQHandler                [WEAK]
                EXPORT  LPTIM1_IRQHandler                 [WEAK]
                EXPORT  CEC_IRQHandler                    [WEAK]   
                EXPORT  I2C4_EV_IRQHandler                [WEAK]
                EXPORT  I2C4_ER_IRQHandler                [WEAK] 
                EXPORT  SPDIF_RX_IRQHandler               [WEAK]
                EXPORT  OTG_FS_EP1_OUT_IRQHandler         [WEAK]
                EXPORT  OTG_FS_EP1_IN_IRQHandler          [WEAK]                      
                EXPORT  OTG_FS_WKUP_IRQHandler            [WEAK]                      
                EXPORT  OTG_FS_IRQHandler                 [WEAK]                        
                EXPORT  DMAMUX1_OVR_IRQHandler            [WEAK]
                EXPORT  HRTIM1_Master_IRQHandler          [WEAK] 
                EXPORT  HRTIM1_TIMA_IRQHandler            [WEAK]                                      
                EXPORT  HRTIM1_TIMB_IRQHandler            [WEAK]                                      
                EXPORT  HRTIM1_TIMC_IRQHandler            [WEAK]                                      
                EXPORT  HRTIM1_TIMD_IRQHandler            [WEAK]                                      
                EXPORT  HRTIM1_TIME_IRQHandler            [WEAK]                                      
                EXPORT  HRTIM1_FLT_IRQHandler             [WEAK]
                EXPORT  DFSDM1_FLT0_IRQHandler            [WEAK] 
                EXPORT  DFSDM1_FLT1_IRQHandler            [WEAK]                                             
                EXPORT  DFSDM1_FLT2_IRQHandler            [WEAK]                                             
                EXPORT  DFSDM1_FLT3_IRQHandler            [WEAK]                                                                                        
                EXPORT  SAI3_IRQHandler                   [WEAK]                                             
                EXPORT  SWPMI1_IRQHandler                 [WEAK]                            
                EXPORT  TIM15_IRQHandler                  [WEAK]                                             
                EXPORT  TIM16_IRQHandler                  [WEAK]                                              
                EXPORT  TIM17_IRQHandler                  [WEAK]                                            
                EXPORT  MDIOS_WKUP_IRQHandler             [WEAK]                                             
                EXPORT  MDIOS_IRQHandler                  [WEAK]                                              
                EXPORT  JPEG_IRQHandler                   [WEAK]                                               
                EXPORT  MDMA_IRQHandler                   [WEAK]                                               
                EXPORT  DSI_IRQHandler                    [WEAK]                                               
                EXPORT  SDMMC2_IRQHandler                 [WEAK]                                             
                EXPORT  HSEM1_IRQHandler                  [WEAK]                                               
                EXPORT  HSEM2_IRQHandler                  [WEAK]                                               
                EXPORT  ADC3_IRQHandler                   [WEAK]                                                
                EXPORT  DMAMUX2_OVR_IRQHandler            [WEAK]                                            
                EXPORT  BDMA_Channel0_IRQHandler          [WEAK]                                      
                EXPORT  BDMA_Channel1_IRQHandler          [WEAK]                                      
                EXPORT  BDMA_Channel2_IRQHandler          [WEAK]                                      
                EXPORT  BDMA_Channel3_IRQHandler          [WEAK]                                      
                EXPORT  BDMA_Channel4_IRQHandler          [WEAK]                                     
                EXPORT  BDMA_Channel5_IRQHandler          [WEAK]                                      
                EXPORT  BDMA_Channel6_IRQHandler          [WEAK]                                      
                EXPORT  BDMA_Channel7_IRQHandler          [WEAK]                                     
                EXPORT  COMP1_IRQHandler                  [WEAK]                                              
                EXPORT  LPTIM2_IRQHandler                 [WEAK]                                           
                EXPORT  LPTIM3_IRQHandler                 [WEAK]                                            
                EXPORT  LPTIM4_IRQHandler                 [WEAK]                                            
                EXPORT  LPTIM5_IRQHandler                 [WEAK]                                            
                EXPORT  LPUART1_IRQHandler                [WEAK]                                                  
                EXPORT  WWDG_RST_IRQHandler               [WEAK]                                
                EXPORT  CRS_IRQHandler                    [WEAK]
                EXPORT  ECC_IRQHandler                    [WEAK]				
                EXPORT  SAI4_IRQHandler                   [WEAK]                                                  
                EXPORT  HOLD_CORE_IRQHandler              [WEAK]                                   
                EXPORT  WAKEUP_PIN_IRQHandler             [WEAK] 


